/* Title for event birthday (with a name) */
"%@\\U2019s Birthday" = "“%@”的生日";

/* Title for event birthday (without a name) */
"Birthday" = "生日";

"FACEBOOK_CALENDAR_NAME" = "Facebook 事件";

/* default calendar name */
"DEFAULT_CALENDAR_NAME" = "日历";

/* default reminders calendar name */
"DEFAULT_TASK_CALENDAR_NAME" = "提醒事项";
// Also this one, sadly.  See 9806767 and 9696624
"Reminders" = "提醒事项";

/* Default name for an event/reminder alarm */
"DEFAULT_REMINDER_NAME" = "提醒事项";

/* Errors, returned as part of EKError object. Generally only for developers, but they might appear in UI.*/
"EVENT_NOT_MUTABLE_ERROR" = "不能编辑该事件。";

"NO_CALENDAR_ERROR" = "尚未设置日历。";

"NO_START_DATE_ERROR" = "尚未设置日历。";

"NO_END_DATE_ERROR" = "尚未设置日历。";

"DATES_INVERTED_ERROR" = "开始日期必须早于结束日期。";

"UNEXPECTED_ERROR" = "发生意外错误。";

"CALENDAR_SOURCE_CANNOT_BE_MODIFIED" = "无法将该日历移到其他帐户。";


"CALENDAR_READ_ONLY_ERROR" = "该日历是只读的。";

"DURATION_EXCEEDS_RECURRENCE_ERROR" = "事件持续时间太长，无法以此高频率重复。";

"ALARM_EXCEEDS_RECURRENCE_ERROR" = "事件的重复发生在提醒之前。";

"START_DATE_FUTURE_ERROR" = "事件设在太遥远的将来。";

"OCCURRENCE_COLLISION_ERROR" = "此事件的另一个实例也发生在这一天。";

"INVITES_CANNOT_MOVE_ERROR" = "不能将邀请函移到其他日历中。";

"CANNOT_GEOCODE_LOCATION_ERROR" = "未能对提醒事项的位置进行地址编码，无法发出提醒。";

/* meaningless to end users, but useful for coders. It means the event is being used with the wrong database (store). */
"WRONG_STORE_ERROR" = "那一事件不属于那个事件资料库。";

/* developer error */
"SPAN_ERROR" = "指定的跨区范围无效。";

"CALENDAR_HAS_NO_SOURCE" = "日历没有来源";

"DOES_NOT_ALLOW_RECURRENCE_CHANGES" = "无法更改重复字段。";

"DOES_NOT_ALLOW_ALARM_CHANGES" = "无法更改提醒。";

"DOES_NOT_ALLOW_ATTENDEE_CHANGES" = "无法更改参加者。";

"CALENDAR_IMMUTABLE" = "无法更改或删除该日历。";

"STRUCTURED_LOCATIONS_NOT_SUPPORTED" = "此帐号不支持包含地理定位信息的位置。";

"ACTIONS_NOT_SUPPORTED" = "此帐户不支持操作。";

"REMINDER_LOCATIONS_NOT_SUPPORTED" = "此帐号不支持提醒事项的位置。";

"ALARM_PROXIMITY_NOT_SUPPORTED" = "此帐户不支持基于邻近度的提醒。";

"RECURRING_TASK_REQUIRES_DUE_DATE_ERROR" = "重复发生的提醒事项必须有截止日期。";

"SOURCE_PROHIBITS_CALENDAR_ADD_DELETE" = "那个帐户不允许添加或移除日历。";

"CALENDAR_DOES_NOT_ALLOW_EVENTS" = "该日历不允许添加事件。";

"CALENDAR_DOES_NOT_ALLOW_REMINDERS" = "该日历不允许添加提醒事项。";

"SOURCE_DOES_NOT_ALLOW_REMINDERS" = "该帐户不支持提醒事项。";

"PRIORITY_IS_INVALID" = "优先级必须在 0 到 9 之间。";

"INVALID_ENTITY_TYPE" = "这不是有效的 EKEntityType.";
